In [1]:
import numpy as np

In [2]:
import pandas as pd
from pandas import Series,DataFrame

### 作业：

#### 1. 反复练习今天的所学全部知识点方法，做到熟练运用.

In [3]:
l = [1,2,3,4,5,6]
s = Series(l)
s

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [4]:
s.index

RangeIndex(start=0, stop=6, step=1)

In [5]:
s.values

array([1, 2, 3, 4, 5, 6], dtype=int64)

In [7]:
display(s[0],s[1])

1

2

In [8]:
s[:2]

0    1
1    2
dtype: int64

In [10]:
s[::-1]

5    6
4    5
3    4
2    3
1    2
0    1
dtype: int64

In [11]:
data = [1,2,3,4,5,6,7]
index='asdfghj'
s = Series(data=data,index=list(index))
s

a    1
s    2
d    3
f    4
g    5
h    6
j    7
dtype: int64

In [12]:
s = Series({"a":1,"b":2,"c":3})
s

a    1
b    2
c    3
dtype: int64

In [13]:
s['a'] =3
s

a    3
b    2
c    3
dtype: int64

In [15]:
s.loc['a']

3

In [17]:
s.iloc[0]

3

In [19]:
s.shape

(3,)

In [20]:
s.size

3

In [22]:
s.head(1)

a    3
dtype: int64

In [24]:
s.tail(1)

c    3
dtype: int64

In [25]:
s.name='1111'

In [26]:
s

a    3
b    2
c    3
Name: 1111, dtype: int64

In [28]:
s

a    3
b    2
c    3
Name: 1111, dtype: int64

In [30]:
s['d'] =np.nan
s

a    3.0
b    2.0
c    3.0
d    NaN
Name: 1111, dtype: float64

In [33]:
s.isnull()

a    False
b    False
c    False
d     True
Name: 1111, dtype: bool

In [34]:
s.notnull()

a     True
b     True
c     True
d    False
Name: 1111, dtype: bool

In [35]:
np.isnan(s)

a    False
b    False
c    False
d     True
Name: 1111, dtype: bool

In [39]:
s1 =Series({"c":6,"d":7})
display(s,s1)

a    3.0
b    2.0
c    3.0
d    NaN
Name: 1111, dtype: float64

c    6
d    7
dtype: int64

In [40]:
s + s1

a    NaN
b    NaN
c    9.0
d    NaN
dtype: float64

In [44]:
s.add(s1,fill_value=1)

a    4.0
b    3.0
c    9.0
d    8.0
dtype: float64

In [45]:
index=['jack','jack1','jack2','jack3','jack4']
columns=['chinese','math','english','python']
data = np.random.randint(100,size=(5,4))
df = DataFrame(data=data,index=index,columns=columns)
df

       chinese  math  english  python
jack        95    99       48      48
jack1       36    70       73      91
jack2       14    83       87      59
jack3       69    91       91      31
jack4       11    63       33      34

In [46]:
index=['jack5','jack6','jack2','jack3','jack4']
columns=['chinese','math','english','python']
data = np.random.randint(100,size=(5,4))
df1 = DataFrame(data=data,index=index,columns=columns)
df1

       chinese  math  english  python
jack5       48    93        6      35
jack6       57    94       96      68
jack2       98    89       90      20
jack3       43    66       83      97
jack4       30    34       21      39

In [48]:
df + df1

       chinese   math  english  python
jack       NaN    NaN      NaN     NaN
jack1      NaN    NaN      NaN     NaN
jack2    112.0  172.0    177.0    79.0
jack3    112.0  157.0    174.0   128.0
jack4     41.0   97.0     54.0    73.0
jack5      NaN    NaN      NaN     NaN
jack6      NaN    NaN      NaN     NaN

In [52]:
df.add(df1,fill_value=0)

       chinese   math  english  python
jack      95.0   99.0     48.0    48.0
jack1     36.0   70.0     73.0    91.0
jack2    112.0  172.0    177.0    79.0
jack3    112.0  157.0    174.0   128.0
jack4     41.0   97.0     54.0    73.0
jack5     48.0   93.0      6.0    35.0
jack6     57.0   94.0     96.0    68.0

In [57]:
df.loc['jack','math']

99

In [60]:
df.loc['jack']

chinese    95
math       99
english    48
python     48
Name: jack, dtype: int32

In [62]:
df.loc[['jack']]

      chinese  math  english  python
jack       95    99       48      48

In [64]:
df['math']

jack     99
jack1    70
jack2    83
jack3    91
jack4    63
Name: math, dtype: int32

In [68]:
df['math']['jack1']

70

In [76]:
df['math']

jack     99
jack1    70
jack2    83
jack3    91
jack4    63
Name: math, dtype: int32

In [77]:
import webbrowser

In [78]:
webbrowser.open('http://www.tiobe.com/tiobe-index/')

True

In [81]:
df1 = pd.read_clipboard()
df1

    Programming Language  2018  2013 2008 2003 1998 1993 1988
0                   Java     1     2    1    1   16    -    -
1                      C     2     1    2    2    1    1    1
2                    C++     3     4    3    3    2    2    4
3                 Python     4     7    5   10   22   21    -
4                     C#     5     5    7    8    -    -    -
5      Visual Basic .NET     6    11    -    -    -    -    -
6                    PHP     7     6    4    5    -    -    -
7             JavaScript     8     8    8    7   19    -    -
8                   Ruby     9    10   10   22    -    -    -
9   Delphi/Object Pascal    10    15    9    9    -    -    -
10           Objective-C    12     3   41   45    -    -    -
11                 COBOL    24    22   15   11    3    9   18
12                  Lisp    29    13   17   14    8    7    2
13                   Ada    31    20   19   15   14    6    3
14                Pascal   194    14   14   96    5    3   14

In [84]:
df1['Programming Language']

0                     Java
1                        C
2                      C++
3                   Python
4                       C#
5        Visual Basic .NET
6                      PHP
7               JavaScript
8                     Ruby
9     Delphi/Object Pascal
10             Objective-C
11                   COBOL
12                    Lisp
13                     Ada
14                  Pascal
Name: Programming Language, dtype: object

In [87]:
df1.columns

Index(['Programming Language', '2018', '2013', '2008', '2003', '1998', '1993',
       '1988'],
      dtype='object')

In [88]:
df2 = DataFrame(df1,columns=['Programming Language','2018'])

In [89]:
df2

    Programming Language  2018
0                   Java     1
1                      C     2
2                    C++     3
3                 Python     4
4                     C#     5
5      Visual Basic .NET     6
6                    PHP     7
7             JavaScript     8
8                   Ruby     9
9   Delphi/Object Pascal    10
10           Objective-C    12
11                 COBOL    24
12                  Lisp    29
13                   Ada    31
14                Pascal   194

In [90]:
df3 = DataFrame(df1,columns=['Programming Language','2018','2023'])
df3

    Programming Language  2018  2023
0                   Java     1   NaN
1                      C     2   NaN
2                    C++     3   NaN
3                 Python     4   NaN
4                     C#     5   NaN
5      Visual Basic .NET     6   NaN
6                    PHP     7   NaN
7             JavaScript     8   NaN
8                   Ruby     9   NaN
9   Delphi/Object Pascal    10   NaN
10           Objective-C    12   NaN
11                 COBOL    24   NaN
12                  Lisp    29   NaN
13                   Ada    31   NaN
14                Pascal   194   NaN

In [93]:
df3['2023'] =np.random.randint(15,size=15)

In [94]:
df3

    Programming Language  2018  2023
0                   Java     1     7
1                      C     2    12
2                    C++     3     1
3                 Python     4    14
4                     C#     5     0
5      Visual Basic .NET     6    11
6                    PHP     7    12
7             JavaScript     8     8
8                   Ruby     9     5
9   Delphi/Object Pascal    10     7
10           Objective-C    12     5
11                 COBOL    24     6
12                  Lisp    29     7
13                   Ada    31     4
14                Pascal   194     9

In [99]:
df3.iloc[14]

Programming Language    Pascal
2018                       194
2023                         9
Name: 14, dtype: object

#### 2. 不看讲义代码，重新实现一遍张三李四的考场故事。

============================================

练习6：

1. 假设ddd是期中考试成绩，ddd2是期末考试成绩，请自由创建ddd2，并将其与ddd相加，求期中期末平均值。

2. 假设张三期中考试数学被发现作弊，要记为0分，如何实现？

3. 李四因为举报张三作弊立功，期中考试所有科目加100分，如何实现？

4. 后来老师发现有一道题出错了，为了安抚学生情绪，给每位学生每个科目都加10分，如何实现？

============================================

In [111]:
index = ['张三','李四']
columns = ['chinese','math','english','python','java']
data = np.random.randint(150,size=(2,5))
ddd = DataFrame(index=index,columns=columns,data=data)
ddd

    chinese  math  english  python  java
张三      108   111      135     114    91
李四       91    26        0      31   133

In [109]:
index = ['张三','李四']
columns = ['chinese','math','english','python','java']
data = np.random.randint(150,size=(2,5))
ddd2 = DataFrame(index=index,columns=columns,data=data)
ddd2

    chinese  math  english  python  java
张三       14    49      107     142    89
李四      107    99      111      64    45

In [112]:
ddd.add(ddd2)/2

    chinese  math  english  python  java
张三     61.0  80.0    121.0   128.0  90.0
李四     99.0  62.5     55.5    47.5  89.0

In [114]:
ddd.loc['张三']['math'] = 0
ddd

    chinese  math  english  python  java
张三      108     0      135     114    91
李四       91    26        0      31   133

In [115]:
ddd.loc['李四'] += 100
ddd

    chinese  math  english  python  java
张三      108     0      135     114    91
李四      191   126      100     131   233

In [116]:
ddd + 10

    chinese  math  english  python  java
张三      118    10      145     124   101
李四      201   136      110     141   243

#### 3. 用今天所学的DataFrame知识点，写一个小说。
参考选题：
- 菜市场张大妈和李大爷的故事
- Python程序员狂虐Java程序员的故事